In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [5]:
%%sql
create database if not exists tutorial;
use tutorial;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
0 rows affected.

[]

In [11]:
%%sql
drop table if exists tutorial.Sales;
CREATE TABLE tutorial.Sales (
    TransactionID INT,
    Store CHAR(1),
    sales_amount DECIMAL(10, 2)
);

INSERT INTO tutorial.Sales (TransactionID, Store, sales_amount) VALUES
(1, 'A', 100.00),
(2, 'A', 200.00),
(3, 'A', 150.00),
(4, 'B', 250.00),
(5, 'B', 300.00);

select * from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'A', Decimal('100.00')),
 (2, 'A', Decimal('200.00')),
 (3, 'A', Decimal('150.00')),
 (4, 'B', Decimal('250.00')),
 (5, 'B', Decimal('300.00'))]

# Usage of SUM() , changes the table structure

In [12]:
%%sql
select store,sum(sales_amount) as sum_total from sales
group by store

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('A', Decimal('450.00')), ('B', Decimal('550.00'))]

# Usage of Window function

In [13]:
%%sql
select TransactionID ,store ,sales_amount,
sum(sales_amount) OVER (partition by store) as total_sales
from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('450.00')),
 (2, 'A', Decimal('200.00'), Decimal('450.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('550.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [14]:
%%sql
select TransactionID ,store ,sales_amount,
sum(sales_amount) OVER (partition by store order by TransactionID) as total_sales
from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('100.00')),
 (2, 'A', Decimal('200.00'), Decimal('300.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('250.00')),
 (5, 'B', Decimal('300.00'), Decimal('550.00'))]

In [15]:
%%sql
select TransactionID ,store ,sales_amount,
sum(sales_amount) OVER (partition by store order by TransactionID desc) as total_sales
from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(3, 'A', Decimal('150.00'), Decimal('150.00')),
 (2, 'A', Decimal('200.00'), Decimal('350.00')),
 (1, 'A', Decimal('100.00'), Decimal('450.00')),
 (5, 'B', Decimal('300.00'), Decimal('300.00')),
 (4, 'B', Decimal('250.00'), Decimal('550.00'))]

In [16]:
%%sql
select TransactionID ,store ,sales_amount,
sum(sales_amount) OVER () as total_sales
from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('1000.00')),
 (2, 'A', Decimal('200.00'), Decimal('1000.00')),
 (3, 'A', Decimal('150.00'), Decimal('1000.00')),
 (4, 'B', Decimal('250.00'), Decimal('1000.00')),
 (5, 'B', Decimal('300.00'), Decimal('1000.00'))]

In [18]:
%%sql
select TransactionID ,store ,sales_amount,
sum(sales_amount) OVER (order by TransactionID) as total_sales
from tutorial.Sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'A', Decimal('100.00'), Decimal('100.00')),
 (2, 'A', Decimal('200.00'), Decimal('300.00')),
 (3, 'A', Decimal('150.00'), Decimal('450.00')),
 (4, 'B', Decimal('250.00'), Decimal('700.00')),
 (5, 'B', Decimal('300.00'), Decimal('1000.00'))]

# ROW_NUMBER() window function

In [21]:
%%sql
select TransactionID,store,sales_amount,
ROW_NUMBER() OVER (ORDER BY SALES_AMOUNT DESC) AS ROWNUM
FROM sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(5, 'B', Decimal('300.00'), 1),
 (4, 'B', Decimal('250.00'), 2),
 (2, 'A', Decimal('200.00'), 3),
 (3, 'A', Decimal('150.00'), 4),
 (1, 'A', Decimal('100.00'), 5)]

In [28]:
%%sql

select TransactionID, Store, Sales_amount,
ROW_NUMBER() OVER (partition by store ORDER BY sales_amount DESC ) AS ROWNUM
from sales;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(2, 'A', Decimal('200.00'), 1),
 (3, 'A', Decimal('150.00'), 2),
 (1, 'A', Decimal('100.00'), 3),
 (5, 'B', Decimal('300.00'), 1),
 (4, 'B', Decimal('250.00'), 2)]

# Deduplication example using ROW_NUMBER()

In [30]:
%%sql
DROP TABLE IF EXISTS tutorial.Employees;
CREATE TABLE Employees (
    EmployeeID INT,
    Name VARCHAR(100),
    Department VARCHAR(50),
    HireDate DATE
);
INSERT INTO tutorial.Employees (EmployeeID, Name, Department, HireDate)
VALUES
(1, 'Alice', 'HR', '2020-05-01'),
(1, 'Alice', 'HR', '2022-06-15'),
(2, 'Bob', 'IT', '2021-07-10'),
(3, 'Charlie', 'Finance', '2020-09-30'),
(3, 'Charlie', 'Finance', '2022-05-22');
select * from  tutorial.employees;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (1, 'Alice', 'HR', datetime.date(2022, 6, 15)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30)),
 (3, 'Charlie', 'Finance', datetime.date(2022, 5, 22))]

In [32]:
%%sql
select EmployeeID,Name,Department,HireDate,
ROW_NUMBER() OVER (PARTITION BY EmployeeID order by HireDate) as Row_num
from employees;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1), 1),
 (1, 'Alice', 'HR', datetime.date(2022, 6, 15), 2),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10), 1),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30), 1),
 (3, 'Charlie', 'Finance', datetime.date(2022, 5, 22), 2)]

In [38]:
%%sql
with emp_rank as(
select EmployeeID,Name,Department,HireDate,
ROW_NUMBER() OVER (PARTITION BY EmployeeID order by HireDate) as Row_num
from employees)
select EmployeeID,Name,Department,HireDate from emp_rank where Row_num=1;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[(1, 'Alice', 'HR', datetime.date(2020, 5, 1)),
 (2, 'Bob', 'IT', datetime.date(2021, 7, 10)),
 (3, 'Charlie', 'Finance', datetime.date(2020, 9, 30))]

# RANK window function

In [42]:
%%sql
DROP TABLE IF EXISTS tutorial.Students;
CREATE TABLE tutorial.Students (
    StudentID INT,
    StudentName VARCHAR(100),
    ExamScore INT
);

INSERT INTO tutorial.Students (StudentID, StudentName, ExamScore) VALUES
(1, 'Alice', 95),
(2, 'Bob', 90),
(3, 'Charlie', 95),
(4, 'David', 85),
(5, 'Eva', 90);
select * from students

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
5 rows affected.
5 rows affected.

[(1, 'Alice', 95),
 (2, 'Bob', 90),
 (3, 'Charlie', 95),
 (4, 'David', 85),
 (5, 'Eva', 90)]

# Rank function ranks the rows and gives same rank if there is two rows with same value and skips the number of repeated ranks

In [49]:
%%sql
select StudentID,StudentName,ExamScore,
RANK() OVER(ORDER by Examscore DESC) as Score
from students

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Alice', 95, 1),
 (3, 'Charlie', 95, 1),
 (2, 'Bob', 90, 3),
 (5, 'Eva', 90, 3),
 (4, 'David', 85, 5)]

# Rank function ranks the rows and gives same rank if there is two rows with same value

In [50]:
%%sql
select StudentID,StudentName,ExamScore,
DENSE_RANK() OVER(ORDER by Examscore DESC) as Score
from students

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Alice', 95, 1),
 (3, 'Charlie', 95, 1),
 (2, 'Bob', 90, 2),
 (5, 'Eva', 90, 2),
 (4, 'David', 85, 3)]

# PERCENT_RANK

In [53]:
%%sql
-- Create the Students table
DROP TABLE IF EXISTS Students;
CREATE TABLE Students (
    StudentID INT,
    StudentName VARCHAR(100),
    ExamScore INT
);

-- Insert 50 rows of synthetic data
INSERT INTO Students (StudentID, StudentName, ExamScore) VALUES
(1, 'Student1', 85),
(2, 'Student2', 90),
(3, 'Student3', 88),
(4, 'Student4', 92),
(5, 'Student5', 75),
(6, 'Student6', 80),
(7, 'Student7', 85),
(8, 'Student8', 89),
(9, 'Student9', 78),
(10, 'Student10', 91),
(11, 'Student11', 82),
(12, 'Student12', 87),
(13, 'Student13', 93),
(14, 'Student14', 76),
(15, 'Student15', 84),
(16, 'Student16', 79),
(17, 'Student17', 81),
(18, 'Student18', 88),
(19, 'Student19', 94),
(20, 'Student20', 77),
(21, 'Student21', 85),
(22, 'Student22', 90),
(23, 'Student23', 88),
(24, 'Student24', 92),
(25, 'Student25', 75),
(26, 'Student26', 80),
(27, 'Student27', 85),
(28, 'Student28', 89),
(29, 'Student29', 78),
(30, 'Student30', 91),
(31, 'Student31', 82),
(32, 'Student32', 87),
(33, 'Student33', 93),
(34, 'Student34', 76),
(35, 'Student35', 84),
(36, 'Student36', 79),
(37, 'Student37', 81),
(38, 'Student38', 88),
(39, 'Student39', 94),
(40, 'Student40', 77),
(41, 'Student41', 83),
(42, 'Student42', 89),
(43, 'Student43', 86),
(44, 'Student44', 92),
(45, 'Student45', 81),
(46, 'Student46', 88),
(47, 'Student47', 90),
(48, 'Student48', 79),
(49, 'Student49', 85),
(50, 'Student50', 93);

SELECT * FROM Students

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
50 rows affected.
50 rows affected.

[(1, 'Student1', 85),
 (2, 'Student2', 90),
 (3, 'Student3', 88),
 (4, 'Student4', 92),
 (5, 'Student5', 75),
 (6, 'Student6', 80),
 (7, 'Student7', 85),
 (8, 'Student8', 89),
 (9, 'Student9', 78),
 (10, 'Student10', 91),
 (11, 'Student11', 82),
 (12, 'Student12', 87),
 (13, 'Student13', 93),
 (14, 'Student14', 76),
 (15, 'Student15', 84),
 (16, 'Student16', 79),
 (17, 'Student17', 81),
 (18, 'Student18', 88),
 (19, 'Student19', 94),
 (20, 'Student20', 77),
 (21, 'Student21', 85),
 (22, 'Student22', 90),
 (23, 'Student23', 88),
 (24, 'Student24', 92),
 (25, 'Student25', 75),
 (26, 'Student26', 80),
 (27, 'Student27', 85),
 (28, 'Student28', 89),
 (29, 'Student29', 78),
 (30, 'Student30', 91),
 (31, 'Student31', 82),
 (32, 'Student32', 87),
 (33, 'Student33', 93),
 (34, 'Student34', 76),
 (35, 'Student35', 84),
 (36, 'Student36', 79),
 (37, 'Student37', 81),
 (38, 'Student38', 88),
 (39, 'Student39', 94),
 (40, 'Student40', 77),
 (41, 'Student41', 83),
 (42, 'Student42', 89),
 (43, 'Student43', 86),
 (44, 'Student44', 92),
 (45, 'Student45', 81),
 (46, 'Student46', 88),
 (47, 'Student47', 90),
 (48, 'Student48', 79),
 (49, 'Student49', 85),
 (50, 'Student50', 93)]

# PERCENT_RANK gives the rank percentage
# PERCENT_RANK =(rank of the row - 1 )/(Total no of rows - 1)

In [56]:
%%sql
select StudentID,StudentName,ExamScore,
PERCENT_RANK() OVER (ORDER BY ExamScore DESC ) AS PercentRank
FROM Students;

 * mysql+mysqlconnector://root:***@localhost
50 rows affected.

[(39, 'Student39', 94, 0.0),
 (19, 'Student19', 94, 0.0),
 (13, 'Student13', 93, 0.04081632653061224),
 (50, 'Student50', 93, 0.04081632653061224),
 (33, 'Student33', 93, 0.04081632653061224),
 (4, 'Student4', 92, 0.10204081632653061),
 (44, 'Student44', 92, 0.10204081632653061),
 (24, 'Student24', 92, 0.10204081632653061),
 (10, 'Student10', 91, 0.16326530612244897),
 (30, 'Student30', 91, 0.16326530612244897),
 (2, 'Student2', 90, 0.20408163265306123),
 (47, 'Student47', 90, 0.20408163265306123),
 (22, 'Student22', 90, 0.20408163265306123),
 (8, 'Student8', 89, 0.2653061224489796),
 (42, 'Student42', 89, 0.2653061224489796),
 (28, 'Student28', 89, 0.2653061224489796),
 (3, 'Student3', 88, 0.32653061224489793),
 (46, 'Student46', 88, 0.32653061224489793),
 (18, 'Student18', 88, 0.32653061224489793),
 (23, 'Student23', 88, 0.32653061224489793),
 (38, 'Student38', 88, 0.32653061224489793),
 (12, 'Student12', 87, 0.42857142857142855),
 (32, 'Student32', 87, 0.42857142857142855),
 (43, 'Student43', 86, 0.46938775510204084),
 (21, 'Student21', 85, 0.4897959183673469),
 (1, 'Student1', 85, 0.4897959183673469),
 (27, 'Student27', 85, 0.4897959183673469),
 (49, 'Student49', 85, 0.4897959183673469),
 (7, 'Student7', 85, 0.4897959183673469),
 (35, 'Student35', 84, 0.5918367346938775),
 (15, 'Student15', 84, 0.5918367346938775),
 (41, 'Student41', 83, 0.6326530612244898),
 (31, 'Student31', 82, 0.6530612244897959),
 (11, 'Student11', 82, 0.6530612244897959),
 (17, 'Student17', 81, 0.6938775510204082),
 (37, 'Student37', 81, 0.6938775510204082),
 (45, 'Student45', 81, 0.6938775510204082),
 (26, 'Student26', 80, 0.7551020408163265),
 (6, 'Student6', 80, 0.7551020408163265),
 (16, 'Student16', 79, 0.7959183673469388),
 (36, 'Student36', 79, 0.7959183673469388),
 (48, 'Student48', 79, 0.7959183673469388),
 (9, 'Student9', 78, 0.8571428571428571),
 (29, 'Student29', 78, 0.8571428571428571),
 (20, 'Student20', 77, 0.8979591836734694),
 (40, 'Student40', 77, 0.8979591836734694),
 (34, 'Student34', 76, 0.9387755102040817),
 (14, 'Student14', 76, 0.9387755102040817),
 (5, 'Student5', 75, 0.9795918367346939),
 (25, 'Student25', 75, 0.9795918367346939)]

# NTILE()

# NTILE() groups the entries based on the values and number of groups given

In [58]:
%%sql
DROP TABLE IF EXISTS EmployeeSales;

CREATE TABLE EmployeeSales (
    EmployeeID INT,
    EmployeeName VARCHAR(50),
    SalesAmount INT
);

INSERT INTO EmployeeSales (EmployeeID, EmployeeName, SalesAmount) VALUES
(1, 'Alice', 10000),
(2, 'Bob', 8500),
(3, 'Charlie', 7500),
(4, 'David', 6000),
(5, 'Eva', 11000),
(6, 'Frank', 4500),
(7, 'Grace', 3000),
(8, 'Hank', 4000),
(9, 'Ivy', 8000),
(10, 'Jack', 9500);

SELECT * FROM EmployeeSales;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
10 rows affected.
10 rows affected.

[(1, 'Alice', 10000),
 (2, 'Bob', 8500),
 (3, 'Charlie', 7500),
 (4, 'David', 6000),
 (5, 'Eva', 11000),
 (6, 'Frank', 4500),
 (7, 'Grace', 3000),
 (8, 'Hank', 4000),
 (9, 'Ivy', 8000),
 (10, 'Jack', 9500)]

# LAG()

In [60]:
%%sql
SELECT EmployeeID,EmployeeName,SalesAmount,
NTILE(4) OVER (ORDER BY SalesAmount DESC) AS performance
FROM EmployeeSales;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(5, 'Eva', 11000, 1),
 (1, 'Alice', 10000, 1),
 (10, 'Jack', 9500, 1),
 (2, 'Bob', 8500, 2),
 (9, 'Ivy', 8000, 2),
 (3, 'Charlie', 7500, 2),
 (4, 'David', 6000, 3),
 (6, 'Frank', 4500, 3),
 (8, 'Hank', 4000, 4),
 (7, 'Grace', 3000, 4)]

In [67]:
%%sql

DROP TABLE IF EXISTS Employees;

CREATE TABLE Employees (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    Salary DECIMAL(10, 2),
    Year INT
);

INSERT INTO Employees (EmployeeID, EmployeeName, Salary, Year) VALUES
(1, 'Alice', 5000.00, 2023),
(1, 'Alice', 5500.00, 2024),
(2, 'Bob', 4500.00, 2023),
(2, 'Bob', 4800.00, 2024),
(3, 'Charlie', 4000.00, 2023),
(3, 'Charlie', 4200.00, 2024),
(4, 'David', 4600.00, 2023),
(4, 'David', 4700.00, 2024),
(5, 'Eva', 5200.00, 2023),
(5, 'Eva', 5400.00, 2024);

SELECT * FROM Employees;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
10 rows affected.
10 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023),
 (1, 'Alice', Decimal('5500.00'), 2024),
 (2, 'Bob', Decimal('4500.00'), 2023),
 (2, 'Bob', Decimal('4800.00'), 2024),
 (3, 'Charlie', Decimal('4000.00'), 2023),
 (3, 'Charlie', Decimal('4200.00'), 2024),
 (4, 'David', Decimal('4600.00'), 2023),
 (4, 'David', Decimal('4700.00'), 2024),
 (5, 'Eva', Decimal('5200.00'), 2023),
 (5, 'Eva', Decimal('5400.00'), 2024)]

In [79]:
%%sql
SELECT *,
lag(salary) OVER (PARTITION BY EmployeeID ORDER BY Year) AS Previous_Salary
FROM Employees;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023, None),
 (1, 'Alice', Decimal('5500.00'), 2024, Decimal('5000.00')),
 (2, 'Bob', Decimal('4500.00'), 2023, None),
 (2, 'Bob', Decimal('4800.00'), 2024, Decimal('4500.00')),
 (3, 'Charlie', Decimal('4000.00'), 2023, None),
 (3, 'Charlie', Decimal('4200.00'), 2024, Decimal('4000.00')),
 (4, 'David', Decimal('4600.00'), 2023, None),
 (4, 'David', Decimal('4700.00'), 2024, Decimal('4600.00')),
 (5, 'Eva', Decimal('5200.00'), 2023, None),
 (5, 'Eva', Decimal('5400.00'), 2024, Decimal('5200.00'))]

In [81]:
%%sql
SELECT *,
lag(salary) OVER (PARTITION BY EmployeeID ORDER BY Year) AS Previous_Salary,
salary - lag(salary) OVER (PARTITION BY EmployeeID ORDER BY Year) AS Difference
FROM Employees;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023, None, None),
 (1, 'Alice', Decimal('5500.00'), 2024, Decimal('5000.00'), Decimal('500.00')),
 (2, 'Bob', Decimal('4500.00'), 2023, None, None),
 (2, 'Bob', Decimal('4800.00'), 2024, Decimal('4500.00'), Decimal('300.00')),
 (3, 'Charlie', Decimal('4000.00'), 2023, None, None),
 (3, 'Charlie', Decimal('4200.00'), 2024, Decimal('4000.00'), Decimal('200.00')),
 (4, 'David', Decimal('4600.00'), 2023, None, None),
 (4, 'David', Decimal('4700.00'), 2024, Decimal('4600.00'), Decimal('100.00')),
 (5, 'Eva', Decimal('5200.00'), 2023, None, None),
 (5, 'Eva', Decimal('5400.00'), 2024, Decimal('5200.00'), Decimal('200.00'))]

# LEAD()

In [84]:
%%sql
DROP TABLE IF EXISTS ProductSales;

CREATE TABLE ProductSales (
    ProductID INT,
    ProductName VARCHAR(50),
    SaleAmount DECIMAL(10, 2),
    SaleDate DATE
);

INSERT INTO ProductSales (ProductID, ProductName, SaleAmount, SaleDate) VALUES
(1, 'Product A', 500.00, '2025-01-01'),
(2, 'Product A', 400.00, '2025-02-02'),
(3, 'Product A', 700.00, '2025-03-01'),
(4, 'Product A', 500.00, '2025-04-01');
SELECT * FROM PRODUCTSALES;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
4 rows affected.
4 rows affected.

[(1, 'Product A', Decimal('500.00'), datetime.date(2025, 1, 1)),
 (2, 'Product A', Decimal('400.00'), datetime.date(2025, 2, 2)),
 (3, 'Product A', Decimal('700.00'), datetime.date(2025, 3, 1)),
 (4, 'Product A', Decimal('500.00'), datetime.date(2025, 4, 1))]

In [89]:
%%sql
SELECT ProductID,ProductName,SaleDate,SaleAmount,
LEAD(SaleAmount) OVER (ORDER BY SaleDate) AS Next_month_sales
FROM ProductSales;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(1, 'Product A', datetime.date(2025, 1, 1), Decimal('500.00'), Decimal('400.00')),
 (2, 'Product A', datetime.date(2025, 2, 2), Decimal('400.00'), Decimal('700.00')),
 (3, 'Product A', datetime.date(2025, 3, 1), Decimal('700.00'), Decimal('500.00')),
 (4, 'Product A', datetime.date(2025, 4, 1), Decimal('500.00'), None)]

In [92]:
%%sql
SELECT ProductID,ProductName,SaleDate,SaleAmount,
LEAD(SaleAmount) OVER (ORDER BY SaleDate) AS Next_month_sales,
LEAD(SaleAmount) OVER (ORDER BY SaleDate)  - SaleAmount AS P_L
FROM ProductSales;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(1, 'Product A', datetime.date(2025, 1, 1), Decimal('500.00'), Decimal('400.00'), Decimal('-100.00')),
 (2, 'Product A', datetime.date(2025, 2, 2), Decimal('400.00'), Decimal('700.00'), Decimal('300.00')),
 (3, 'Product A', datetime.date(2025, 3, 1), Decimal('700.00'), Decimal('500.00'), Decimal('-200.00')),
 (4, 'Product A', datetime.date(2025, 4, 1), Decimal('500.00'), None, None)]

In [8]:
%%sql
DROP TABLE IF EXISTS tutorial.EmployeeData;

CREATE TABLE tutorial.EmployeeData (
    EmployeeID INT,
    EmployeeName VARCHAR(50),
    Salary DECIMAL(10, 2),
    Year INT
);

INSERT INTO tutorial.EmployeeData (EmployeeID, EmployeeName, Salary, Year) VALUES
(1, 'Alice', 5000.00, 2023),
(1, 'Alice', 5500.00, 2023),
(1, 'Alice', 6000.00, 2024),
(2, 'David', 4800.00, 2024),
(1, 'Alice', 6500.00, 2025),
(2, 'David', 5300.00, 2025),
(3, 'Grace', 4500.00, 2023),
(4, 'Hank', 4900.00, 2023),
(3, 'Grace', 5000.00, 2024),
(2, 'David', 4300.00, 2023),
(4, 'Hank', 5900.00, 2025),
(5, 'Liam', 5800.00, 2025),
(3, 'Grace', 4000.00, 2023),
(4, 'Hank', 5400.00, 2024),
(5, 'Liam', 5400.00, 2024);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
15 rows affected.

[]

In [10]:
%%sql
select * from tutorial.EmployeeData

 * mysql+mysqlconnector://root:***@localhost
15 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023),
 (1, 'Alice', Decimal('5500.00'), 2023),
 (1, 'Alice', Decimal('6000.00'), 2024),
 (2, 'David', Decimal('4800.00'), 2024),
 (1, 'Alice', Decimal('6500.00'), 2025),
 (2, 'David', Decimal('5300.00'), 2025),
 (3, 'Grace', Decimal('4500.00'), 2023),
 (4, 'Hank', Decimal('4900.00'), 2023),
 (3, 'Grace', Decimal('5000.00'), 2024),
 (2, 'David', Decimal('4300.00'), 2023),
 (4, 'Hank', Decimal('5900.00'), 2025),
 (5, 'Liam', Decimal('5800.00'), 2025),
 (3, 'Grace', Decimal('4000.00'), 2023),
 (4, 'Hank', Decimal('5400.00'), 2024),
 (5, 'Liam', Decimal('5400.00'), 2024)]

In [12]:
%%sql
select * ,
first_value(Salary) over (partition by EmployeeName order by year) as First_salary
from tutorial.EmployeeData;

 * mysql+mysqlconnector://root:***@localhost
15 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023, Decimal('5000.00')),
 (1, 'Alice', Decimal('5500.00'), 2023, Decimal('5000.00')),
 (1, 'Alice', Decimal('6000.00'), 2024, Decimal('5000.00')),
 (1, 'Alice', Decimal('6500.00'), 2025, Decimal('5000.00')),
 (2, 'David', Decimal('4300.00'), 2023, Decimal('4300.00')),
 (2, 'David', Decimal('4800.00'), 2024, Decimal('4300.00')),
 (2, 'David', Decimal('5300.00'), 2025, Decimal('4300.00')),
 (3, 'Grace', Decimal('4500.00'), 2023, Decimal('4500.00')),
 (3, 'Grace', Decimal('4000.00'), 2023, Decimal('4500.00')),
 (3, 'Grace', Decimal('5000.00'), 2024, Decimal('4500.00')),
 (4, 'Hank', Decimal('4900.00'), 2023, Decimal('4900.00')),
 (4, 'Hank', Decimal('5400.00'), 2024, Decimal('4900.00')),
 (4, 'Hank', Decimal('5900.00'), 2025, Decimal('4900.00')),
 (5, 'Liam', Decimal('5400.00'), 2024, Decimal('5400.00')),
 (5, 'Liam', Decimal('5800.00'), 2025, Decimal('5400.00'))]

In [17]:
%%sql
select * ,
last_value(Salary) over (partition by EmployeeName order by year
                        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) as Last_salary,
last_value(Salary) over (partition by EmployeeName order by year
                        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) - salary as Last_salary
from tutorial.EmployeeData;

 * mysql+mysqlconnector://root:***@localhost
15 rows affected.

[(1, 'Alice', Decimal('5000.00'), 2023, Decimal('6500.00'), Decimal('1500.00')),
 (1, 'Alice', Decimal('5500.00'), 2023, Decimal('6500.00'), Decimal('1000.00')),
 (1, 'Alice', Decimal('6000.00'), 2024, Decimal('6500.00'), Decimal('500.00')),
 (1, 'Alice', Decimal('6500.00'), 2025, Decimal('6500.00'), Decimal('0.00')),
 (2, 'David', Decimal('4300.00'), 2023, Decimal('5300.00'), Decimal('1000.00')),
 (2, 'David', Decimal('4800.00'), 2024, Decimal('5300.00'), Decimal('500.00')),
 (2, 'David', Decimal('5300.00'), 2025, Decimal('5300.00'), Decimal('0.00')),
 (3, 'Grace', Decimal('4500.00'), 2023, Decimal('5000.00'), Decimal('500.00')),
 (3, 'Grace', Decimal('4000.00'), 2023, Decimal('5000.00'), Decimal('1000.00')),
 (3, 'Grace', Decimal('5000.00'), 2024, Decimal('5000.00'), Decimal('0.00')),
 (4, 'Hank', Decimal('4900.00'), 2023, Decimal('5900.00'), Decimal('1000.00')),
 (4, 'Hank', Decimal('5400.00'), 2024, Decimal('5900.00'), Decimal('500.00')),
 (4, 'Hank', Decimal('5900.00'), 2025, Decimal('5900.00'), Decimal('0.00')),
 (5, 'Liam', Decimal('5400.00'), 2024, Decimal('5800.00'), Decimal('400.00')),
 (5, 'Liam', Decimal('5800.00'), 2025, Decimal('5800.00'), Decimal('0.00'))]

In [18]:
# Nth_value

In [23]:
%%sql
DROP TABLE IF EXISTS tutorial.EmployeesSalary;

CREATE TABLE tutorial.EmployeesSalary (
    EmployeeID INT,
    EmployeeName VARCHAR(100),
    Department VARCHAR(50),
    Salary DECIMAL(10, 2),
    SalaryDate DATE
);

INSERT INTO tutorial.EmployeesSalary (EmployeeID, EmployeeName, Department, Salary, SalaryDate) VALUES
(1, 'Alice', 'HR', 5000.00, '2025-01-01'),
(7, 'Grace', 'HR', 5500.00, '2025-01-07'),
(4, 'David', 'HR', 6000.00, '2025-01-04'),
(6, 'Frank', 'Engineering', 6500.00, '2025-01-06'),
(2, 'Bob', 'Engineering', 7000.00, '2025-01-02'),
(5, 'Eva', 'Engineering', 7500.00, '2025-01-05'),
(3, 'Charlie', 'Engineering', 8000.00, '2025-01-03'),
(8, 'Hank', 'Engineering', 8500.00, '2025-01-08');

SELECT * FROM tutorial.EmployeesSalary;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
8 rows affected.
8 rows affected.

[(1, 'Alice', 'HR', Decimal('5000.00'), datetime.date(2025, 1, 1)),
 (7, 'Grace', 'HR', Decimal('5500.00'), datetime.date(2025, 1, 7)),
 (4, 'David', 'HR', Decimal('6000.00'), datetime.date(2025, 1, 4)),
 (6, 'Frank', 'Engineering', Decimal('6500.00'), datetime.date(2025, 1, 6)),
 (2, 'Bob', 'Engineering', Decimal('7000.00'), datetime.date(2025, 1, 2)),
 (5, 'Eva', 'Engineering', Decimal('7500.00'), datetime.date(2025, 1, 5)),
 (3, 'Charlie', 'Engineering', Decimal('8000.00'), datetime.date(2025, 1, 3)),
 (8, 'Hank', 'Engineering', Decimal('8500.00'), datetime.date(2025, 1, 8))]

In [27]:
%%sql
select * ,
nth_value(salary,3) over (partition by Department order by Salary desc
ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) AS nth
from tutorial.EmployeesSalary;

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[(8, 'Hank', 'Engineering', Decimal('8500.00'), datetime.date(2025, 1, 8), Decimal('7500.00')),
 (3, 'Charlie', 'Engineering', Decimal('8000.00'), datetime.date(2025, 1, 3), Decimal('7500.00')),
 (5, 'Eva', 'Engineering', Decimal('7500.00'), datetime.date(2025, 1, 5), Decimal('7500.00')),
 (2, 'Bob', 'Engineering', Decimal('7000.00'), datetime.date(2025, 1, 2), Decimal('7500.00')),
 (6, 'Frank', 'Engineering', Decimal('6500.00'), datetime.date(2025, 1, 6), Decimal('7500.00')),
 (4, 'David', 'HR', Decimal('6000.00'), datetime.date(2025, 1, 4), Decimal('5000.00')),
 (7, 'Grace', 'HR', Decimal('5500.00'), datetime.date(2025, 1, 7), Decimal('5000.00')),
 (1, 'Alice', 'HR', Decimal('5000.00'), datetime.date(2025, 1, 1), Decimal('5000.00'))]